/**
 * mock拦截首页的数据请求 index.html
 * author: wang bin
 */

// 获取企业top100
Mock.mock('/getTopIndustry', {
  max: 3600,
  'list': getDataRc('RCData-frxytop100')
});

Mock.mock('/compDetail1', {
  keyTable: {
    name: '荣成泰祥食品股份有限公司', corporation: '于建洋',
    regCapital: '7388万人于币', tel: '7500万人民币',
    date: '2016-05-11', economicNature: '股份有限公司(中外合资、未上市)',
    unifiedCode: '913700006137722062', registration: '371082400002081',
    address: '山东省荣成市石岛渔岛路',
    scope: '荣成泰祥食品股份有限公司',
    level: 'AAA',
    score: 1440
  },
  plusData: [
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-07-16         ',
      desc: '被列入行业红名单或获评高等级信用类别的',
      index: '被列入行业红名单或获评高等级信用类别的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-18         ',
      desc: '荣成泰祥食品股份有限公司被荣成市委市政府授予2018年度标准制修订表彰单位',
      index: '受到县市级表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-18',
      desc: '荣成泰祥食品股份有限公司被荣成市委市政府授予2018年度科技进步表彰单位',
      index: '被列入行业红名单或获评高等级信用类别的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-18        ',
      desc: '荣成泰祥食品股份有限公司被荣成市委市政府授予2018年度明星企业',
      index: '受到县市级表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-18         ',
      desc: '荣成泰祥食品股份有限公司被荣成市委市政府授予2018年度创新平台表彰单位',
      index: '受到县市级表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-07-16         ',
      desc: '荣成泰祥食品股份有限公司被荣成市委市政府授予2018年度质量品品牌建设表彰单位',
      index: '受到县市级表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-01         ',
      desc: '荣成泰祥食品股份有限公司被石岛管理区党工委、管委会授予2018年度科技创新和品牌建设先进企业',
      index: '受到荣成市级部门表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-01         ',
      desc: '荣成泰祥食品股份有限公司被石岛管理区党工委、管委会授予2018年度功勋企业',
      index: '受到荣成市级部门表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-01         ',
      desc: '慈心一日捐活动中捐款1350000元',
      index: '捐款一百万元至五百万（含）元',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2018-08-03         ',
      desc: '诚信履约、守信经营',
      index: '获得省级“守合同重信用企业”称号的',
      submission: '市场监督管理局'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2018-07-04         ',
      desc: 'A类纳税人',
      index: '拥有市场监管、税务、海关、安监、住建、交通、国土、水利、环保、人社、食品药品监督、林业、价格、金融等部门在市场流通、税费缴纳、报关通关、产品与服务质量、工程质量、安全生产、工程建设、食品安全、土地使用、环境保护、社会保障、商品价格、信贷融资等领域高等级信用类别的',
      submission: '荣成市'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2018-04-12         ',
      desc: '被威海市人社局、总工会、工商联、企业联合会等部门评为2017年度模范劳动关系和谐企业',
      index: '受到威海市部门级表彰奖励的记录',
      submission: '人力资源和社会保障局'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2018-03-01         ',
      desc: '2017年强化安全生产责任落实。',
      index: '受到地市级或省级以上行政主管部门、行业组织表彰奖励的',
      submission: '安监局'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2018-02-25         ',
      desc: '荣成市泰祥食品股份有限公司被国务院授予“国家科学技术进步奖二等”荣誉称号。',
      index: '受到国家级表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2017-12-04         ',
      desc: '诚信履约、守信经营',
      index: '获得地级市“守合同重信用企业”称号的',
      submission: '市场监督管理局'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2017-12-04         ',
      desc: '诚信履约、守信经营',
      index: '获得地级市“守合同重信用企业”称号的',
      submission: '市场监督管理局'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2017-11-25         ',
      desc: '慈心一日捐',
      index: '捐款十万元至一百万（含）元',
      submission: '石岛管理区'
    }

  ],
  minusData: []
})
Mock.mock('/compDetail2', {
  keyTable: {
    name: '山东荣成农村商业银行股份有限公司', corporation: '卢均平',
    regCapital: '80426万人民币', tel: '80426万人民币',
    date: '2016-05-11', economicNature: '内资企业',
    unifiedCode: '91370000567717088J', registration: '370000000002543',
    address: '荣成市成山大道中段15号',
    scope: '山东荣成农村商业银行股份有限公司',
    level: 'AAA',
    score: 1323
  },
  plusData: [
    {
      date: '2018-02-24         ',
      desc: '被威海市委、市政府授予2017年度纳税明星企业',
      index: '受到地市级或省级以上行政主管部门 、行业组织表彰奖励的',
      submission: '农村商业银行'
    },
    {
    	date: '2017-12-11         ',
    	desc: '荣成农村商业银行被中国人民银行威海心支行、中国银行业监督管理委员会威海监管分局、威海市金融工作办公室联合授予”普惠金融突出贡献奖“',
    	index: '受到威海市部门级表彰奖励的记录',
    	submission: '农村商业银行'
    },
    {
    	date: '2018-02-24         ',
    	desc: '被威海市委、	市政府授予“优秀单位”',
    	index: '受到地市级或省级以上行政主管部门、行业组织表彰奖励的',
    	submission: '农村商业银行'
    },
    {
    	date: '2017-11-11         ',
    	desc: '中国服务县域经济领军银行',
    	index: '受到地市级或省级以上行政主管部门、行业组织表彰奖励的',
    	submission: '农村商业银行'
    },
    {
    	date: '2018-02-03         ',
    	desc: '荣成农商行被省联社授予2017年度”信息工作先进集体“',
    	index: '受到地市级或省级以上行政主管部门 、行业组织表彰奖励的',
    	submission: '农村商业银行'
    },
    {
    	date: '2017-11-25         ',
    	desc: '慈心一日捐',
    	index: '捐款十万元至一百万（含）元',
    	submission: '民政局'
    },
    {
    	date: '22018-02-12         ',
    	desc: '被威海银监分局授予”2017年威海银行业新闻宣传先进单位“',
    	index: '受到威海市部门级表彰奖励的记录',
    	submission: '农村商业银行'
    },
    {
    	date: '2018-07-04         ',
    	desc: 'A类纳税人',
    	index: '拥有市场监管、税务、海关、安监、住建、交通、国土、水利、环保、人社、食品药品监督、林业、价格、金融等部门在市场流通、税费缴纳、报关通关、产品与服务质量、工程质量、安全生产、工程建设、食品安全、土地使用、环境保护、社会保障、商品价格、信贷融资等领域高等级信用类别的',
    	submission: '农村商业银行'
    },

  ],
  minusData: []
})
Mock.mock('/compDetail3', {
  keyTable: {
    name: '山东俚岛海洋科技股份有限公司', corporation: '曲光伟',
    regCapital: '5668万人于币', tel: '5668万人民币',
    date: '1999-07-28', economicNature: '私营企业',
    unifiedCode: '91371000706245923C', registration: '',
    address: '荣成市俚岛镇俚岛村',
    scope: '山东俚岛海洋科技股份有限公司',
    level: 'AAA',
    score: 1300
  },
  plusData: [
    {
      date: '2016-08-22         ',
      desc: '诚信履约，守法经营',
      index: '受到省部级表彰奖励的',
      submission: '市场监督管理局'
    },
    {
    	date: '2018-02-25         ',
    	desc: '获评2017年度创新创业表彰单位，表彰事项“山东省名牌产品”。',
    	index: '获得省部级质量奖项或被评为省部级名牌产品等的',
    	submission: '俚岛镇'
    },
    {
    	date: '2017-11-25         ',
    	desc: '慈心一日捐',
    	index: '捐款一万元至十万（含）元',
    	submission: '民政局'
    },
    {
    	date: '2017-12-24         ',
    	desc: '在2017山东特色产业镇发展峰会上被授予2017年山东特色产业镇动能转换二十强优秀企业',
    	index: '受到地市级或省级以上行政主管部门、行业组织表彰奖励的',
    	submission: '中小企业局'
    },
    {
    	date: '2018-08-03         ',
    	desc: '诚信履约、守信经营',
    	index: '获得省级“守合同重信用企业”称号的',
    	submission: '市场监督管理局'
    },
    {
    	date: '2018-07-10         ',
    	desc: 'A类纳税人',
    	index: '拥有市场监管、税务、海关、安监、住建、交通、国土、水利、环保、人社、食品药品监督、林业、价格、金融等部门在市场流通、税费缴纳、报关通关、产品与服务质量、工程质量、安全生产、工程建设、食品安全、土地使用、环境保护、社会保障、商品价格、信贷融资等领域高等级信用类别的',
    	submission: '税务局'
    },
    {
    	date: '2018-03-01         ',
    	desc: '2017年获山东特色产业镇动能转换二十强（山东省中小企业局授予）',
    	index: '受到地市级或省级以上行政主管部门、行业组织表彰奖励的',
    	submission: '俚岛镇'
    },
    {
    	date: '2018-04-12         ',
    	desc: '被威海市人社局、总工会、工商联、企业联合会共同评为2017年度威海市模范劳动关系和谐企业。',
    	index: '受到威海市部门级表彰奖励的记录',
    	submission: '人力资源和社会保障局'
    },

  ],
  minusData: []
})
Mock.mock('/compDetail4', {
  keyTable: {
    name: '黄海造船有限公司', corporation: '赵建平',
    regCapital: '110000万人于币', tel: '110000万人民币',
    date: '2016-05-11', economicNature: '私营企业',
    unifiedCode: '913710821668520946', registration: '371082228010120',
    address: '荣成市石岛黄海中路18号',
    scope: '黄海造船有限公司',
    level: 'AAA',
    score: 1280
  },
  plusData: [
    {

      date: '2016-08-08         ',
      desc: '诚信履约，守法经营',
      index: '受到国家级表彰奖励的',
      submission: '市场监督管理局'
    },
    {

    	date: '2017-11-25         ',
    	desc: '慈心一日捐',
    	index: '捐款十万元至一百万（含）元',
    	submission: '民政局'
    },
    {

    	date: '2018-05-23         ',
    	desc: '捐款一万元至十万（含）元',
    	index: '2018社会妈妈捐款10000元',
    	submission: '妇联'
    },
    {

    	date: '2018-08-03         ',
    	desc: '诚信履约，守法经营',
    	index: '获得省级“守合同重信用企业”称号的',
    	submission: '市场监督管理局'
    },
    {

    	date: '2018-07-04         ',
    	desc: 'A类纳税人',
    	index: '拥有市场监管、税务、海关、安监、住建、交通、国土、水利、环保、人社、食品药品监督、林业、价格、金融等部门在市场流通、税费缴纳、报关通关、产品与服务质量、工程质量、安全生产、工程建设、食品安全、土地使用、环境保护、社会保障、商品价格、信贷融资等领域高等级信用类别的',
    	submission: '税务局'
    },
    {

    	date: '2019-02-18         ',
    	desc: '黄海造船有限公司被荣成市委市政府授予2018年度质量品牌建设表彰单位',
    	index: '受到县市级表彰奖励的',
    	submission: '石岛管理区'
    },
    {

    	date: '2019-02-18         ',
    	desc: '黄海造船有限公司被荣成市委市政府授予2018年度功勋企业',
    	index: '受到县市级表彰奖励的',
    	submission: '石岛管理区'
    },
    {

    	date: '2019-02-01         ',
    	desc: '黄海造船有限公司被石岛管理区党工委、管委会授予2018年度功勋企业',
    	index: '受到荣成市级部门表彰奖励的',
    	submission: '石岛管理区'
    },
    {

    	date: '2019-02-01         ',
    	desc: '黄海造船有限公司被石岛管理区党工委、管维护授予2018年度科技创新和品牌建设先进企业',
    	index: '受到荣成市级部门表彰奖励的',
    	submission: '石岛管理区'
    },
    {

    	date: '2016-08-08         ',
    	desc: '诚信履约，守法经营',
    	index: '受到国家级表彰奖励的',
    	submission: '市场监督管理局'
    },

  ],
  minusData: [ {

  	date: '2018-12-26         ',
  	desc: '未与威海市远东装饰工程有限公司签订专门的安全生产管理协议',
  	index: '被处以较重罚款的行政处罚的',
  	submission: '应急管理局'
  }]
})
Mock.mock('/compDetail5', {
	keyTable: {
		name: '赤山集团有限公司', corporation: '王玉春',
		regCapital: '8000万人于币', tel: '8000万人民币',
		date: '1999-01-29', economicNature: '内资企业',
		unifiedCode: '91371082166861353G', registration: '371082018018209',
		address: '山东省威海市荣成市斥山街道双山东路599号',
		scope: '赤山集团有限公司',
		level: 'AAA',
		score: 1280
	},
	plusData: [
	           {

	        	   date: '2016-08-22         ',
	        	   desc: '诚信履约，守法经营',
	        	   index: '受到省部级表彰奖励的',
	        	   submission: '市场监督管理局'
	           },
	           {

	        	   date: '2017-11-25         ',
	        	   desc: '慈心一日捐',
	        	   index: '捐款十万元至一百万（含）元',
	        	   submission: '民政局'
	           },
	           {

	        	   date: '2018-03-01         ',
	        	   desc: '2017年强化安全生产责任落实。',
	        	   index: '受到省部级表彰奖励的',
	        	   submission: '应急管理局'
	           },
	           {

	        	   date: '2018-07-04         ',
	        	   desc: 'A类纳税人',
	        	   index: '拥有市场监管、税务、海关、安监、住建、交通、国土、水利、环保、人社、食品药品监督、林业、价格、金融等部门在市场流通、税费缴纳、报关通关、产品与服务质量、工程质量、安全生产、工程建设、食品安全、土地使用、环境保护、社会保障、商品价格、信贷融资等领域高等级信用类别的',
	        	   submission: '税务局'
	           },
	           {

	        	   date: '2018-12-26         ',
	        	   desc: '慈心一日捐活 动中捐款1700000元',
	        	   index: '捐款一百万元至五百万（含）元',
	        	   submission: '民政局'
	           },
	           {

	        	   date: '2018-12-10         ',
	        	   desc: '企业包扶村投入',
	        	   index: '捐款十万元至一百万（含）元',
	        	   submission: '斥山街道'
	           },
	           {

	        	   date: '2018-08-03         ',
	        	   desc: '诚信履约，守法经营',
	        	   index: '获得省级“守合同重信用企业”称号的',
	        	   submission: '市场监督管理局'
	           },
	           {

	        	   date: '慈善捐款 		2019-03-05         ',
	        	   desc: '捐款100000元',
	        	   index: '慈善捐款',
	        	   submission: '宣传部'
	           },

	           ],
	           minusData: []
})
Mock.mock('/qyJcDetail', {
  'list|10': [
    { content: '措施内容措施内容措施内容措施内容措施内容措施内容措施内容措施内容', dept: '措施部门' }
  ]
})

Mock.mock('/grJcDetail', {
  'list|10': [
    { content: '措施内容措施内容措施内容措施内容措施内容措施内容措施内容措施内容', dept: '措施部门' }
  ]
})

Mock.mock('/cunZhanbi', {
  data: [
    { type: '村支书记', s5: '66.6%', s4: '55.6%', s3: '44.6%', s2: '33.6%', s1: '22.6%', s0: '11.6%' },
    { type: '村委会主任', s5: '66.6%', s4: '55.6%', s3: '44.6%', s2: '33.6%', s1: '22.6%', s0: '11.6%' },
    { type: '会计', s5: '66.6%', s4: '55.6%', s3: '44.6%', s2: '33.6%', s1: '22.6%', s0: '11.6%' },
    { type: '两委人员', s5: '66.6%', s4: '55.6%', s3: '44.6%', s2: '33.6%', s1: '22.6%', s0: '11.6%' },
    { type: '妇联主席', s5: '66.6%', s4: '55.6%', s3: '44.6%', s2: '33.6%', s1: '22.6%', s0: '11.6%' },
  ]
})

Mock.mock('/cunShuliang', {
  data: [
    { type: '村支书记', s5: 111, s4: 222, s3: 333, s2: 213, s1: 12, s0: 131 },
    { type: '村委会主任', s5: 111, s4: 222, s3: 333, s2: 213, s1: 12, s0: 131 },
    { type: '会计', s5: 111, s4: 222, s3: 333, s2: 213, s1: 12, s0: 131 },
    { type: '两委人员', s5: 111, s4: 222, s3: 333, s2: 213, s1: 12, s0: 131 },
    { type: '妇联主席', s5: 111, s4: 222, s3: 333, s2: 213, s1: 12, s0: 131 }
  ]
})
