// 获取企业top100Mock
Mock.mock('/getTopIndustryMock', {
  max: 3600,
  'list|100': [
    {
      name: 'xxxx股份有限公司',
      'score|1000-3600': 1,
      level: 'AAA'
    }
  ]
})

Mock.mock('/compDetail', {
  keyTable: {
    name: '荣成泰祥食品股份有限公司', corporation: '于建洋',
    regCapital: '7500万人民币', tel: '',
    date: '2016-05-11', economicNature: '',
    unifiedCode: '913700006137722062', registration: '371082400002081',
    address: '山东省荣成市石岛渔岛路',
    scope: '荣成泰祥食品股份有限公司',
    level: 'AAA',
    score: 1440
  },
  plusData: [
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-07-16         ',
      desc: '被列入行业红名单或获评高等级信用类别的',
      index: '被列入行业红名单或获评高等级信用类别的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-18         ',
      desc: '荣成泰祥食品股份有限公司被荣成市委市政府授予2018年度标准制修订表彰单位',
      index: '受到县市级表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-18',
      desc: '荣成泰祥食品股份有限公司被荣成市委市政府授予2018年度科技进步表彰单位',
      index: '被列入行业红名单或获评高等级信用类别的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-18        ',
      desc: '荣成泰祥食品股份有限公司被荣成市委市政府授予2018年度明星企业',
      index: '受到县市级表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-18         ',
      desc: '荣成泰祥食品股份有限公司被荣成市委市政府授予2018年度创新平台表彰单位',
      index: '受到县市级表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-07-16         ',
      desc: '荣成泰祥食品股份有限公司被荣成市委市政府授予2018年度质量品品牌建设表彰单位',
      index: '受到县市级表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-01         ',
      desc: '荣成泰祥食品股份有限公司被石岛管理区党工委、管委会授予2018年度科技创新和品牌建设先进企业',
      index: '受到荣成市级部门表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-01         ',
      desc: '荣成泰祥食品股份有限公司被石岛管理区党工委、管委会授予2018年度功勋企业',
      index: '受到荣成市级部门表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2019-02-01         ',
      desc: '慈心一日捐活动中捐款1350000元',
      index: '捐款一百万元至五百万（含）元',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2018-08-03         ',
      desc: '诚信履约、守信经营',
      index: '获得省级“守合同重信用企业”称号的',
      submission: '市场监督管理局'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2018-07-04         ',
      desc: 'A类纳税人',
      index: '拥有市场监管、税务、海关、安监、住建、交通、国土、水利、环保、人社、食品药品监督、林业、价格、金融等部门在市场流通、税费缴纳、报关通关、产品与服务质量、工程质量、安全生产、工程建设、食品安全、土地使用、环境保护、社会保障、商品价格、信贷融资等领域高等级信用类别的',
      submission: '荣成市'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2018-04-12         ',
      desc: '被威海市人社局、总工会、工商联、企业联合会等部门评为2017年度模范劳动关系和谐企业',
      index: '受到威海市部门级表彰奖励的记录',
      submission: '人力资源和社会保障局'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2018-03-01         ',
      desc: '2017年强化安全生产责任落实。',
      index: '受到地市级或省级以上行政主管部门、行业组织表彰奖励的',
      submission: '安监局'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2018-02-25         ',
      desc: '荣成市泰祥食品股份有限公司被国务院授予“国家科学技术进步奖二等”荣誉称号。',
      index: '受到国家级表彰奖励的',
      submission: '石岛管理区'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2017-12-04         ',
      desc: '诚信履约、守信经营',
      index: '获得地级市“守合同重信用企业”称号的',
      submission: '市场监督管理局'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2017-12-04         ',
      desc: '诚信履约、守信经营',
      index: '获得地级市“守合同重信用企业”称号的',
      submission: '市场监督管理局'
    },
    {
      name: '荣成泰祥食品股份有限公司',
      unifiedCode: '913700006137722062',
      date: '2017-11-25         ',
      desc: '慈心一日捐',
      index: '捐款十万元至一百万（含）元',
      submission: '石岛管理区'
    }

  ],
  minusData: []
})
