Mock.mock('/memoJili', {
  'data|18': [{ name: '激励备忘录名称', dept: 'xxx发起部门', nature: '激励' }]
})

Mock.mock('/memoChengjie', {
  'data|18': [{ name: '惩戒备忘录名称', dept: 'xxx发起部门', nature: '惩戒' }]
})

Mock.mock('/redList', {
  'data|20': [{ name: 'xxxxx红名单', type: 'red', num: '@integer(0, 1000)' }]
})

Mock.mock('/blackList', {
  'data|20': [{ name: 'xxxxx黑名单', type: 'black', num: '@integer(0, 1000)' }]
})

Mock.mock('/qyJcDetail', {
  'list|10': [
    { content: '措施内容措施内容措施内容措施内容措施内容措施内容措施内容措施内容', dept: '措施部门' }
  ]
})

Mock.mock('/grJcDetail', {
  'list|10': [
    { content: '措施内容措施内容措施内容措施内容措施内容措施内容措施内容措施内容', dept: '措施部门' }
  ]
})

Mock.mock('/cunZhanbi', {
  data: [
    { type: '村支书记', s5: '66.6%', s4: '55.6%', s3: '44.6%', s2: '33.6%', s1: '22.6%', s0: '11.6%' },
    { type: '村委会主任', s5: '66.6%', s4: '55.6%', s3: '44.6%', s2: '33.6%', s1: '22.6%', s0: '11.6%' },
    { type: '会计', s5: '66.6%', s4: '55.6%', s3: '44.6%', s2: '33.6%', s1: '22.6%', s0: '11.6%' },
    { type: '两委人员', s5: '66.6%', s4: '55.6%', s3: '44.6%', s2: '33.6%', s1: '22.6%', s0: '11.6%' },
    { type: '妇联主席', s5: '66.6%', s4: '55.6%', s3: '44.6%', s2: '33.6%', s1: '22.6%', s0: '11.6%' },
  ]
})

Mock.mock('/cunShuliang', {
  data: [
    { type: '村支书记', s5: 111, s4: 222, s3: 333, s2: 213, s1: 12, s0: 131 },
    { type: '村委会主任', s5: 111, s4: 222, s3: 333, s2: 213, s1: 12, s0: 131 },
    { type: '会计', s5: 111, s4: 222, s3: 333, s2: 213, s1: 12, s0: 131 },
    { type: '两委人员', s5: 111, s4: 222, s3: 333, s2: 213, s1: 12, s0: 131 },
    { type: '妇联主席', s5: 111, s4: 222, s3: 333, s2: 213, s1: 12, s0: 131 }
  ]
})

/*{
  name: '俚岛镇',
  rank: 排名,
  total: 数据总量,
  value: 信用指数,
  count: 人口,
  data: 百人数据量,
  s5: 五星人数 + 占比 ,
  s4: 四星人数 + 占比 ,
  s3: 三星人数 + 占比 ,
  s2: 二星人数 + 占比 ,
  s1: 一星人数 + 占比 ,
  s0: 零星人数 + 占比 ,
  list: { // 7个月的数据
    xData: ['1月', '2月', '3月', '4月', '5月', '6月', '7月'], // 月份
    'numData|7': ['@integer(0, 10000)'], // 七月数据量
    'valData|7': ['@integer(0, 10000)'] // 七个月的信用指数
  }
}*/
Mock.mock('/getMapData', {
  'data|22': [
    {
      'name|+1': [
        '俚岛镇',
        '滕家镇',
        '人和镇',
        '大疃镇',
        '埠柳镇',
        '上庄镇',
        '荫子镇',
        '崖西镇',
        '虎山镇',
        '夏庄镇',
        '成山镇',
        '港西镇',
        '宁津街道',
        '港湾街道',
        '桃源街道',
        '王连街道',
        '东山街道',
        '斥山街道',
        '崖头街道',
        '城西街道',
        '寻山街道',
        '崂山街道'
      ],
      'rank|+1': 1,
      total: '@integer(0, 3000)',
      value: '@integer(0, 3000)',
      count: '@integer(0, 3000)',
      data: '@integer(0, 666)',
      s5: '@integer(0, 666), 占比@integer(0, 99)%',
      s4: '@integer(0, 666), 占比@integer(0, 99)%',
      s3: '@integer(0, 666), 占比@integer(0, 99)%',
      s2: '@integer(0, 666), 占比@integer(0, 99)%',
      s1: '@integer(0, 666), 占比@integer(0, 99)%',
      s0: '@integer(0, 666), 占比@integer(0, 99)%',
      list: {
        xData: ['1月', '2月', '3月', '4月', '5月', '6月', '7月'],
        'numData|7': ['@integer(0, 10000)'],
        'valData|7': ['@integer(0, 1500)']
      }
    }
  ]
})

